Autodesk.Revit.DB.ElementPhaseStatusFilter.GetPhaseStatuses
Returns the phase statuses assigned to this filter.
Returns:
The phase statuses.
Since:
2012

Autodesk.Revit.DB.ElementPhaseStatusFilter.PhaseId
The phase id.
Since:
2012

Autodesk.Revit.DB.ElementPhaseStatusFilter.#ctor(Autodesk.Revit.DB.ElementId,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementOnPhaseStatus},System.Boolean)
Constructs a new instance of a file to match elements that have a given phase statuses on the input phase, with the option
to match all elements that have a phase status other than the input statuses.
phaseId:
Id of the phase.
phaseStatuses:
Target statuses.
inverted:
True to match all phase statuses other than the input statuses.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ElementPhaseStatusFilter.#ctor(Autodesk.Revit.DB.ElementId,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementOnPhaseStatus})
Constructs a new instance of a file to match elements that have a given phase statuses on the input phase.
phaseId:
Id of the phase.
phaseStatuses:
Target statuses.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ElementPhaseStatusFilter.#ctor(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementOnPhaseStatus,System.Boolean)
Constructs a new instance of a file to match elements that have a given phase status on the input phase, with the option
to match all elements that have a phase status other than the input status.
phaseId:
Id of the phase.
phaseStatus:
Target status.
inverted:
True to match all phase statuses other than the input status.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.ElementPhaseStatusFilter.#ctor(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementOnPhaseStatus)
Constructs a new instance of a file to match elements that have a given phase status on the input phase.
phaseId:
Id of the phase.
phaseStatus:
Target status.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.ElementPhaseStatusFilter
A filter used to match elements that have a given phase status on a given phase.
Remarks:
This filter is a slow filter.
Slow filters require that the Element be obtained and expanded in memory first.
Thus it is preferable to couple this filter with at least one ElementQuickFilter,
which should minimize the number of Elements that are expanded.
Since:
2012